_posts/2021-12-17-boj-14469.html
---
title: BOJ 14469 소가 길을 건너간 이유 3
tags: STL
---

<div id="outline-container-org4788227" class="outline-2">
<h2 id="org4788227">BOJ 14469 소가 길을 건너간 이유 3</h2>
<div class="outline-text-2" id="text-org4788227">
<ul class="org-ul">
<li>소가 순서대로 길을 건너야함</li>
<li>앞의 소가 모두 건널때까지 기다려야 함</li>
</ul>
</div>
</div>

<div id="outline-container-org0658d8f" class="outline-2">
<h2 id="org0658d8f">접근하기</h2>
<div class="outline-text-2" id="text-org0658d8f">
<ul class="org-ul">
<li>앞의 끝시간 &gt; 지금의 시작시간일 때를 찾아서 뒤로 미루는 코드 생각하기</li>
</ul>
</div>
</div>

<div id="outline-container-orgf64c683" class="outline-2">
<h2 id="orgf64c683">코드 - 구조체 이용</h2>
<div class="outline-text-2" id="text-orgf64c683">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #888a85;">// </span><span style="color: #888a85;">&#44396;&#51312;&#52404; s, e&#51060;&#50857;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">e</span>;
}<span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cmp</span>(<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> p1.s &lt; p2.s;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">v</span>(N); 
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>, <span style="color: #ff6347;">len</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;s, &amp;len);
        v[i].s = s;
        v[i].e = s + len;
    }
    sort(v.begin(), v.end(), cmp);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span> = v[i].e - v[i].s;
        <span style="color: #729fcf; font-weight: bold;">if</span> (v[i-1].e &gt; v[i].s) {
            v[i].s = v[i-1].e;
            v[i].e = v[i].s + len;
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, v[N-1].e);

    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org64c6fdc" class="outline-2">
<h2 id="org64c6fdc">코드 - STL pair 이용</h2>
<div class="outline-text-2" id="text-org64c6fdc">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #888a85;">// </span><span style="color: #888a85;">&#44396;&#51312;&#52404; s, e&#51060;&#50857;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;utility&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cmp</span>(<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">pair</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt;&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">pair</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt;&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> p1.first &lt; p2.first;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">pair</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt;&gt; <span style="color: #ff6347;">v</span>(N); 
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>, <span style="color: #ff6347;">len</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;s, &amp;len);
        v[i].first = s;
        v[i].second = s + len;
    }
    sort(v.begin(), v.end(), cmp);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span> = v[i].second - v[i].first;
        <span style="color: #729fcf; font-weight: bold;">if</span> (v[i-1].second &gt; v[i].first) {
            v[i].first = v[i-1].second;
            v[i].second = v[i].first + len;
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, v[N-1].second);

    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0c777c" class="outline-2">
<h2 id="orge0c777c">문제 링크</h2>
<div class="outline-text-2" id="text-orge0c777c">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/14469">https://www.acmicpc.net/problem/14469</a></li>
</ul>
</div>
</div>
